{
  "memes": [
    {
      "title": "Doge",
      "description": "Doge is a slang term for \"dog\" that is primarily associated with pictures of Shiba Inus.",
      "year": "2005-06-24",
      "img_link": "https://i.kym-cdn.com/entries/icons/original/000/013/564/doge.jpg",
      "id": 0
    },
    {
      "id": 1,
      "title": "Nyan Cat",
      "description": "Nyan Cat, also known as Pop Tart Cat, is an 8-bit animation depicting a cat with the body of a cherry Pop-Tart flying through outer space.",
      "year": "2011-04-02",
      "img_link": "https://i.kym-cdn.com/entries/icons/mobile/000/005/608/nyan-cat-01-625x450.jpg"
    },
    {
      "id": 3,
      "title": "Rickroll",
      "description": "Rick Astley's dance pop single \"Never Gonna Give You Up\" was originally released as part of his 1987 solo debut album Whenever You Need Somebody. Upon its initial release, the single became a number one hit on several international charts, including the Billboard Hot 100 and UK Singles Chart[1]. YouTuber Erik Helwig claims to have prank called a Michigan radio station after a sports game and played \"Never Gonna Give You Up\" over the phone on August 31st, 2006",
      "year": "2006-08-31",
      "img_link": "https://i.kym-cdn.com/entries/icons/mobile/000/000/007/bd6.jpg"
    },
    {
      "title": "Charlie Bit My Finger",
      "description": "Charlie Bit Me, also known as \"Charlie bit my finger\", is a homemade movie of a playful interaction between two British brothers that ends with an adorable quote by the three-year-old Harry, who goes on to say \"Charlie bit me. And that really hurt\" after getting his finger bitten by his one-year-old toddler brother on camera. Upon entering online circulation in May 2007, the video quickly went viral spawned a large collection of remix and parody videos on YouTube.",
      "year": "2019-02-27",
      "img_link": "https://i.kym-cdn.com/entries/icons/mobile/000/000/131/tdy_or_charlie_150501.today-inline-vid-featured-desktop.jpg",
      "id": 4
    },
    {
      "title": "All Your Base Are Belong To Us",
      "description": "\"All Your Base Are Belong to Us\" is a popular engrish catchphrase that grew popular across the internet as early as in 1998. An awkward translation of \"all of your bases are now under our control\", the quote originally appeared in the opening dialogue of Zero Wing, a 16-bit shoot'em up game released in 1989. Marked by poor grammar, the \"All Your Base\" phrase and the dialogue scene went viral on popular discussion forums in 2000, spawning thousands of image macros and flash animations featuring the slogan both on the web and in real life.",
      "year": "2000-12-06",
      "img_link": "https://i.kym-cdn.com/photos/images/newsfeed/000/000/999/AllYourBaseAnimated.gif",
      "id": 5
    },
    {
      "title": "Leekspin",
      "description": "\"Leekspin\", also known as \"Loituma Girl\", is a flash animation loop of a female anime character twirling a stock of spring onion, often referred to as a leek or a negi, while set to the Finnish folk song \"Ievan Polkka\" (Eva's Polka). This simple animation and it's catchy song managed to make a massive impact on the English and Japanese internet during the mid-2000s, spawning many parodies and remixes.",
      "year": "2006-05-26",
      "img_link": "https://i.kym-cdn.com/photos/images/newsfeed/000/328/161/576.gif",
      "id": 6
    },
    {
      "title": "Trollface",
      "description": "Trollface is a rage comic character wearing a mischievous smile that is meant to represent the facial expression of an Internet troll. The image is most commonly used to portray a character as a troll in rage comics, or alternatively, to identify oneself or another participant as such in online discussions.",
      "year": "2008-09-19",
      "img_link": "https://i.kym-cdn.com/entries/icons/original/000/000/091/TrollFace.jpg",
      "id": 7
    },
    {
      "title": "It's Over 9000!",
      "description": "\"Over 9000\" is a popular catchphrase based on an awkwardly translated quote from the Japanese manga anime series Dragon Ball Z that is typically used as an innumerable quantifier to describe a large number of something like \"several\", \"lots\", \"butt loads\" and even the metric \"ass tonne\".",
      "year": "2006-11-21",
      "img_link": "https://i.kym-cdn.com/entries/icons/mobile/000/000/056/itsover1000.jpg",
      "id": 8
    },
    {
      "title": "Numa Numa",
      "description": "Numa Numa is a video created by New Jersey amateur videographer Gary Brolsma, in which he performs a lip dub of the song \"Dragostea din tei\" by the Moldovan pop group O-Zone. Since its online debut on Newgrounds in December of 2004, the video has gained significant fame both online and offline for its parodies and re-enactment videos.",
      "year": "2005-02-23",
      "img_link": "https://i.kym-cdn.com/entries/icons/square/000/000/070/Picture_61.png",
      "id": 9
    },
    {
      "title": "Shoop Da Whoop",
      "description": "Shoop da Whoop, also known as I'M A' FIRIN' MAH LAZER!! shows a blackface mouth and eyes suddenly (and frequently without warning) shooting a powerful stream of laser.",
      "year": "2007-01-29",
      "img_link": "https://i.kym-cdn.com/photos/images/newsfeed/000/175/722/IMMA_FIRIN_MA_LAZER_by_ToaJahli.jpg?1316406167",
      "id": 10
    },
    {
      "title": "Wombo Combo",
      "description": "\"Wombo Combo\" is a memorable quote derived from a viral video showcasing a Super Smash Bros. Melee match in which a man can be heard loudly celebrating the execution of a winning combo. The phrase has since been used to describe impressive combination moves in a variety of other video games and audio from the match is often dubbed in various parody and remix videos.",
      "year": "2009-03-30",
      "img_link": "https://i.kym-cdn.com/entries/icons/mobile/000/000/078/wombocombo.jpg",
      "id": 11
    },
    {
      "title": "What is Love?",
      "description": "\"What is Love\" is a 1993 dance pop song by the Trinidanian eurodance artist Haddaway, which saw a resurgence in popularity when it was featured in the \"Roxbury Guys\" sketches on TV show Saturday Night Live in 1996. In 2005, a scene from the show in which several characters are shown bobbing their heads in unison to \"What is Love\" was uploaded as a GIF to YTMND, which inspired a fad on the community website.",
      "year": "2005-06-23",
      "img_link": "https://i.kym-cdn.com/photos/images/newsfeed/000/460/314/28d.gif",
      "id": 12
    }
  ],
  "players": [
    {
      "id": 0,
      "username": "player",
      "high_score": 0
    },
    {
      "id": 1,
      "username": "meme_lord",
      "high_score": 99
    }
  ],
  "questions": [
    {
      "id": 0,
      "type": "img_qu",
      "entitled": "Quel est le meme au chat multicolore ?",
      "id_rep": 1
    },
    {
      "id": 1,
      "type": "string_qu",
      "entitled": "Quel est la race de chien du meme doge ?",
      "id_rep": "Shiba Inu"
    },
    {
      "type": "string_qu",
      "entitled": "Quel est le nom du bébé qui mort le doigt ?",
      "id_rep": "Charlie",
      "id": 2
    },
    {
      "type": "img_qu",
      "entitled": "Quel extrait est issu du jeu Super Smash Bros ?",
      "id_rep": "11",
      "id": 3
    },
    {
      "type": "string_qu",
      "entitled": "Dans le meme \"What is Love?\", comment s'appele l'homme à l'arrière de la voiture ?",
      "id_rep": "Jim Carrey",
      "id": 4
    },
    {
      "type": "img_qu",
      "entitled": "Trouver le meme issu de Dragon Ball",
      "id_rep": "8",
      "id": 5
    },
    {
      "type": "string_qu",
      "entitled": "Quelle est la nationalité du groupe O-Zone ?",
      "id_rep": "Moldave",
      "id": 6
    },
    {
      "type": "img_qu",
      "entitled": "Dans quel meme trouve-t-on Rick Astley ?",
      "id_rep": "3",
      "id": 7
    },
    {
      "type": "string_qu",
      "entitled": "Dans le meme \"Leekspin\", que tient la femme dans sa main ?",
      "id_rep": "Poireau",
      "id": 8
    },
    {
      "type": "img_qu",
      "entitled": "Trouver le meme comportant une erreur de traduction",
      "id_rep": "5",
      "id": 9
    },
    {
      "type": "string_qu",
      "entitled": "Compléter la phrase suivante : \"Don't feed the ...\"",
      "id_rep": "Troll",
      "id": 10
    },
    {
      "type": "img_qu",
      "entitled": "Quel meme est souvent accompagné de la musique \"I am Glad, 'cause I'm Finally Returning Back Home\" ?",
      "id_rep": "7",
      "id": 11
    }
  ]
}